benchmark/go-frameworks/results/20260924-102750/results/get/fasthttp/r2/80000.txt
Running 40s test @ http://10.128.0.4:8086/api/devices
  16 threads and 512 connections
  Thread calibration: mean lat.: 1.060ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.047ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.052ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.047ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.042ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.043ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.047ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.047ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.044ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.044ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.042ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.043ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.041ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.058ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.057ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.058ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.03ms  484.34us  13.59ms   68.02%
    Req/Sec     5.28k   319.68     7.55k    72.08%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.01ms
 75.000%    1.35ms
 90.000%    1.62ms
 99.000%    2.13ms
 99.900%    3.95ms
 99.990%    7.36ms
 99.999%   10.45ms
100.000%   13.60ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.086     0.000000            1         1.00
       0.418     0.100000       238884         1.11
       0.586     0.200000       478853         1.25
       0.735     0.300000       717648         1.43
       0.873     0.400000       955929         1.67
       1.006     0.500000      1194590         2.00
       1.073     0.550000      1314663         2.22
       1.140     0.600000      1432863         2.50
       1.209     0.650000      1552750         2.86
       1.279     0.700000      1672455         3.33
       1.349     0.750000      1790623         4.00
       1.386     0.775000      1851301         4.44
       1.423     0.800000      1910307         5.00
       1.463     0.825000      1969856         5.71
       1.507     0.850000      2029298         6.67
       1.557     0.875000      2088715         8.00
       1.585     0.887500      2118636         8.89
       1.616     0.900000      2148894        10.00
       1.650     0.912500      2178722        11.43
       1.688     0.925000      2208324        13.33
       1.732     0.937500      2238347        16.00
       1.757     0.943750      2253350        17.78
       1.784     0.950000      2267882        20.00
       1.814     0.956250      2282733        22.86
       1.848     0.962500      2297946        26.67
       1.886     0.968750      2312610        32.00
       1.908     0.971875      2320202        35.56
       1.931     0.975000      2327434        40.00
       1.959     0.978125      2334980        45.71
       1.991     0.981250      2342524        53.33
       2.028     0.984375      2349800        64.00
       2.051     0.985938      2353638        71.11
       2.077     0.987500      2357413        80.00
       2.107     0.989062      2361103        91.43
       2.145     0.990625      2364879       106.67
       2.195     0.992188      2368496       128.00
       2.229     0.992969      2370395       142.22
       2.271     0.993750      2372180       160.00
       2.335     0.994531      2374046       182.86
       2.433     0.995313      2375935       213.33
       2.575     0.996094      2377774       256.00
       2.683     0.996484      2378717       284.44
       2.811     0.996875      2379640       320.00
       2.947     0.997266      2380573       365.71
       3.105     0.997656      2381517       426.67
       3.283     0.998047      2382439       512.00
       3.391     0.998242      2382905       568.89
       3.497     0.998437      2383373       640.00
       3.633     0.998633      2383835       731.43
       3.789     0.998828      2384305       853.33
       3.973     0.999023      2384769      1024.00
       4.089     0.999121      2385001      1137.78
       4.227     0.999219      2385239      1280.00
       4.383     0.999316      2385474      1462.86
       4.579     0.999414      2385701      1706.67
       4.835     0.999512      2385933      2048.00
       4.987     0.999561      2386048      2275.56
       5.179     0.999609      2386167      2560.00
       5.367     0.999658      2386282      2925.71
       5.655     0.999707      2386399      3413.33
       5.995     0.999756      2386515      4096.00
       6.243     0.999780      2386573      4551.11
       6.471     0.999805      2386634      5120.00
       6.675     0.999829      2386690      5851.43
       6.895     0.999854      2386750      6826.67
       7.131     0.999878      2386806      8192.00
       7.275     0.999890      2386835      9102.22
       7.383     0.999902      2386865     10240.00
       7.539     0.999915      2386895     11702.86
       7.687     0.999927      2386923     13653.33
       7.999     0.999939      2386953     16384.00
       8.151     0.999945      2386967     18204.44
       8.271     0.999951      2386981     20480.00
       8.519     0.999957      2386996     23405.71
       8.751     0.999963      2387010     27306.67
       8.975     0.999969      2387025     32768.00
       9.135     0.999973      2387032     36408.89
       9.215     0.999976      2387039     40960.00
       9.399     0.999979      2387047     46811.43
       9.679     0.999982      2387054     54613.33
       9.887     0.999985      2387061     65536.00
      10.183     0.999986      2387065     72817.78
      10.295     0.999988      2387068     81920.00
      10.455     0.999989      2387073     93622.86
      10.671     0.999991      2387076    109226.67
      10.879     0.999992      2387079    131072.00
      11.087     0.999993      2387081    145635.56
      11.391     0.999994      2387083    163840.00
      11.967     0.999995      2387085    187245.71
      12.039     0.999995      2387087    218453.33
      12.071     0.999996      2387088    262144.00
      12.127     0.999997      2387089    291271.11
      12.175     0.999997      2387090    327680.00
      12.503     0.999997      2387091    374491.43
      12.543     0.999998      2387092    436906.67
      12.703     0.999998      2387093    524288.00
      12.703     0.999998      2387093    582542.22
      12.759     0.999998      2387094    655360.00
      12.759     0.999999      2387094    748982.86
      13.079     0.999999      2387095    873813.33
      13.079     0.999999      2387095   1048576.00
      13.079     0.999999      2387095   1165084.44
      13.431     0.999999      2387096   1310720.00
      13.431     0.999999      2387096   1497965.71
      13.431     0.999999      2387096   1747626.67
      13.431     1.000000      2387096   2097152.00
      13.431     1.000000      2387096   2330168.89
      13.599     1.000000      2387097   2621440.00
      13.599     1.000000      2387097          inf
#[Mean    =        1.025, StdDeviation   =        0.484]
#[Max     =       13.592, Total count    =      2387097]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  3193808 requests in 40.00s, 1.18GB read
Requests/sec:  79848.97
Transfer/sec:     30.31MB